create_clock -period 10.000 -name a_bus.clk -waveform {0.000 5.000} [get_ports {a_bus\\.clk}]
create_clock -period 10.000 -name b_bus.clk -waveform {0.000 5.000} [get_ports {b_bus\\.clk}]
create_clock -period 10.000 -name c_bus.clk -waveform {0.000 5.000} [get_ports {c_bus\\.clk}]
create_clock -period 2.000 -name clk -waveform {0.000 1.000} [get_ports clk]
create_clock -period 20.000 -name config_bus.pclk -waveform {0.000 10.000} [get_ports {config_bus\\.pclk}]
set_clock_groups -asynchronous -group [get_clocks clk] -group [get_clocks a_bus.clk]
set_clock_groups -asynchronous -group [get_clocks clk] -group [get_clocks b_bus.clk]
set_clock_groups -asynchronous -group [get_clocks a_bus.clk] -group [get_clocks clk]
set_clock_groups -asynchronous -group [get_clocks b_bus.clk] -group [get_clocks clk]
set_false_path -from [get_clocks clk] -to [get_clocks config_bus.pclk]
set_clock_groups -asynchronous -group [get_clocks config_bus.pclk] -group [get_clocks c_bus.clk]
set_clock_groups -asynchronous -group [get_clocks config_bus.pclk] -group [get_clocks clk]
